using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class AppStartMovieScene : MonoBehaviour
{
    // ------------------ //    
    // --- 序列化    
    // ------------------ //

    // ------------------ //    
    // --- 公有成员    
    // ------------------ //

    // ------------------ //   
    // --- 私有成员    
    // ------------------ //

    // ------------------ //    
    // --- Unity消息    
    // ------------------ //

    // ------------------ //    
    // --- 公有方法   
    // ------------------ //

    // ------------------ //   
    // --- 私有方法
    // ------------------ //
}
