using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using Sirenix.OdinInspector;

/// <summary>
/// 零件编辑空间
/// 空间包含三个基础触发器
/// 编辑区域：零件设计时可放置的区域
/// 允许编辑：角色进入该区域时才可以开始设计零件
/// 相机引导：该区域用于指导相机进行聚焦动作
/// </summary>
public class PartDesignZone : SerializedMonoBehaviour
{
	// ----------------//
	// --- 序列化
	// ----------------//

	// ----------------//
	// --- 公有成员
	// ----------------//

	// ----------------//
	// --- 私有成员
	// ----------------//

	// ----------------//
	// --- Unity消息
	// ----------------//

	// ----------------//
	// --- 公有方法
	// ----------------//

	// ----------------//
	// --- 私有方法
	// ----------------//

	// ----------------//
	// --- 类型
	// ----------------//
}
